Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum
The weld electrode classification.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_NONE
No electrode classification.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_35
The electrode classification 35.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_42
The electrode classification 42.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_50
The electrode classification 50.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_E60XX
The electrode classification E60XX.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_E70XX
The electrode classification E70XX.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_E80XX
The electrode classification E80XX.

Tekla.Structures.Model.BaseWeld.WeldElectrodeClassificationEnum.WELD_ELECTRODE_CLASSIFICATION_E90XX
The electrode classification E90XX.